In [46]:
import pandas as pd
import numpy as np

In [47]:
date = pd.read_csv('data/date.csv')
time = pd.read_csv('data/messages.csv')

In [48]:
date.drop(columns=['product_id','city_id'],inplace=True)
date.sample()

           date  orders
408  2019-05-31       8

In [49]:
time.sample()

                    date                                                msg
617  2013-02-13 00:32:00  если я не ошибаюсь то сибири!я даже фильм тако...

In [50]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   orders  1000 non-null   int64
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [51]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Hadle the date

In [52]:
# firstly we have convert date column in to date time data type
date['date'] =  pd.to_datetime(date['date'])

In [53]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   orders  1000 non-null   int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 15.8 KB

In [54]:
# for month
date['month'] =  date['date'].dt.month
date.sample(3)

          date  orders  month
121 2018-08-30      54      8
244 2019-11-13       1     11
745 2019-05-18       1      5

In [55]:
# for year
date['year'] = date['date'].dt.year
date.sample(3)

          date  orders  month  year
746 2019-02-01       5      2  2019
571 2018-09-18       1      9  2018
898 2019-02-20       2      2  2019

In [56]:
# for days
date['day'] = date['date'].dt.day
date.sample(3)

          date  orders  month  year  day
406 2018-11-20       1     11  2018   20
963 2019-10-14      24     10  2019   14
181 2019-04-12       2      4  2019   12

In [57]:
# for month name
date['month_name'] = date['date'].dt.month_name()
date.sample(3)

          date  orders  month  year  day month_name
233 2019-08-17       6      8  2019   17     August
12  2019-03-15       1      3  2019   15      March
130 2019-07-12       2      7  2019   12       July

In [58]:
# day of week
date['dayofweek'] = date['date'].dt.dayofweek
date.sample(3)

          date  orders  month  year  day month_name  dayofweek
886 2018-09-05       1      9  2018    5  September          2
630 2018-11-29       1     11  2018   29   November          3
77  2018-11-02       1     11  2018    2   November          4

In [59]:
# day week name
date['week-name'] = date['date'].dt.day_name()
date.sample(3)

          date  orders  month  year  day month_name  dayofweek week-name
137 2019-03-14       1      3  2019   14      March          3  Thursday
313 2018-12-29     125     12  2018   29   December          5  Saturday
260 2019-02-04       1      2  2019    4   February          0    Monday

In [62]:
# is weekend ?
date['is-weekend'] = np.where(date['week-name'].isin(['Sunday','Saturday']),'Yes','No')
date.sample(3)

,date,orders,month,year,day,month_name,dayofweek,week-name,is-weekend
737,2019-04-24,3,4,2019,24,April,2,Wednesday,No
721,2019-06-13,6,6,2019,13,June,3,Thursday,No
953,2018-11-24,120,11,2018,24,November,5,Saturday,Yes

In [68]:
# Extract week of the year
date['Week-year'] = date['date'].dt.isocalendar().week
date.sample(3)

,date,orders,month,year,day,month_name,dayofweek,week-name,is-weekend,Week-year
397,2019-06-25,1,6,2019,25,June,1,Tuesday,No,26
925,2018-12-27,62,12,2018,27,December,3,Thursday,No,52
200,2019-02-06,5,2,2019,6,February,2,Wednesday,No,6

In [70]:
date['quarter'] = date['date'].dt.quarter
date.sample(3)

,date,orders,month,year,day,month_name,dayofweek,week-name,is-weekend,Week-year,quarter
999,2019-10-15,22,10,2019,15,October,1,Tuesday,No,42,4
459,2019-05-02,2,5,2019,2,May,3,Thursday,No,18,2
884,2019-04-03,7,4,2019,3,April,2,Wednesday,No,14,2

In [71]:
# for semester
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)
date.sample(3)

,date,orders,month,year,day,month_name,dayofweek,week-name,is-weekend,Week-year,quarter,semester
820,2019-07-27,2,7,2019,27,July,5,Saturday,Yes,30,3,2
983,2019-08-02,1,8,2019,2,August,4,Friday,No,31,3,2
691,2019-06-22,2,6,2019,22,June,5,Saturday,Yes,25,2,1

In [72]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2025, 12, 12, 12, 8, 43, 736580)

In [73]:
# difference 
today - date['date']

0     2194 days 12:08:43.736580
1     2676 days 12:08:43.736580
2     2607 days 12:08:43.736580
3     2309 days 12:08:43.736580
4     2532 days 12:08:43.736580
                 ...
995   2622 days 12:08:43.736580
996   2563 days 12:08:43.736580
997   2411 days 12:08:43.736580
998   2476 days 12:08:43.736580
999   2250 days 12:08:43.736580
Name: date, Length: 1000, dtype: timedelta64[ns]

In [79]:
# how manys days only
((today - date['date']).dt.days)

0      2194
1      2676
2      2607
3      2309
4      2532
       ...
995    2622
996    2563
997    2411
998    2476
999    2250
Name: date, Length: 1000, dtype: int64

In [81]:
# how many months passed
((today - date['date']).dt.days)/31

0      70.774194
1      86.322581
2      84.096774
3      74.483871
4      81.677419
         ...
995    84.580645
996    82.677419
997    77.774194
998    79.870968
999    72.580645
Name: date, Length: 1000, dtype: float64

In [82]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

# handle time

In [83]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [84]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00